src/content/post/julia-rust-ecosystem/index.md
---
author: Edmund Miller
publishDate: "2022-07-01T14:42Z"
title: A Comparison of the Julia and Rust Ecosystems
description: What they're getting right, and what's still missing.
tags: ["Julia", "Rust"]
draft: true
---

```
# Intro

-   Feris Juggling the Julia logo
-   Rust is the most loved language in stackoverflow **again**
-   Julia is climbing the ranks
-   Written in the last decade so they don\'t have to deal with legacy
    issues Even more inspired after the juliacon keynote comparing Julia
    to go

# [TODO]{.todo .TODO} Built-in package management {#built-in-package-management}

# [TODO]{.todo .TODO} Central package store {#central-package-store}

# [TODO]{.todo .TODO} Types {#types}

-   The best part is they\'re there when you want them(when you\'re
    developing packages)

# [TODO]{.todo .TODO} Baked in testing suite is adequate(ie don\'t need pytest/jest) {#baked-in-testing-suite-is-adequateie-dont-need-pytestjest}

<https://doc.rust-lang.org/book/ch11-00-testing.html>

# [TODO]{.todo .TODO} Community {#community}

# [TODO]{.todo .TODO} Easy version management {#easy-version-management}

<https://github.com/JuliaLang/juliaup>

# [TODO]{.todo .TODO} Does it\'s main feature and does it well {#does-its-main-feature-and-does-it-well}

-   Rust is focused on memory safety
-   Julia is focused on being fast
    -   Link to why we wrote Julia

# But the compile times in both are slow!

But it\'s not going to get worse?
```
